package net.engining.pcx.ci.infrastructure.shared.enums;

import net.engining.pg.support.meta.EnumInfo;

@EnumInfo({
	"T01|IT/互联网/通信/电子",
	"T02|金融/会计/银行/保险",
	"T03|房地产/建筑业",
	"T04|商业服务",
	"T05|教育/培训",
	"T06|广告/媒体",
	"T07|消费品/贸易/批发/零售",
	"T08|加工制造/仪表设备",
	"T09|交通/物流/运输",
	"T10|制药/医疗",
	"T11|服务业",
	"T12|能源/采掘/化工/环保",
	"T13|政府/农林牧渔/其他"
})
public enum CorpSic {
	/**
	 * IT/互联网/通信/电子
	 */
	T01,
	/**
	 * 金融/会计/银行/保险
	 */
	T02,
	/**
	 * 房地产/建筑业
	 */
	T03,
	/**
	 * 商业服务
	 */
	T04,
	
	/**
	 * 教育/培训
	 */
	T05,
	/**
	 * 广告/媒体
	 */
	T06,
	/**
	 * 消费品/贸易/批发/零售
	 */
	T07,
	/**
	 * 加工制造/仪表设备
	 */
	T08,
	/**
	 * 交通/物流/运输
	 */
	T09,
	/**
	 * 制药/医疗
	 */
	T10,
	/**
	 * 服务业
	 */
	T11,
	/**
	 * 能源/采掘/化工/环保
	 */
	T12,
	/**
	 * 政府/农林牧渔/其他
	 */
	T13
}
